#Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.
summa_xy = int (input ('Введите сумму Х + Y = '))
product_xy = int (input ('Введите произведение Х * Y = '))
for x in range (1,1001):
    for y in range (1,1001):
        if summa_xy==x+y and product_xy == x*y:
            print ('Х = ', x, 'Y = ', y)
            

    