#Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
number = int(input ('Введите количество журавликов '))
print ('Петя - ', int (number/6), 'Катя - ', int (number/6*4), 'Сережа -', int (number/6))
